qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402cx.h
#define CRM_PLLCFG_PLLU_EN_Pos              (29U)
#define CRM_PLLCFG_PLLU_EN_Msk              (0x1U << CRM_PLLCFG_PLLU_EN_Pos)        /*!< 0x20000000 */
#define CRM_PLLCFG_PLLU_EN                  CRM_PLLCFG_PLLU_EN_Msk                  /*!< PLLU enable */
#define CRM_PLLCFG_PLLRCS_Pos               (30U)
#define CRM_PLLCFG_PLLRCS_Msk               (0x1U << CRM_PLLCFG_PLLRCS_Pos)         /*!< 0x40000000 */
#define CRM_PLLCFG_PLLRCS                   CRM_PLLCFG_PLLRCS_Msk                   /*!< PLL reference clock select */
#define CRM_PLLCFG_PLLRST_Pos               (31U)
#define CRM_PLLCFG_PLLRST_Msk               (0x1U << CRM_PLLCFG_PLLRST_Pos)         /*!< 0x80000000 */
#define CRM_PLLCFG_PLLRST                   CRM_PLLCFG_PLLRST_Msk                   /*!< PLLRST */

/*******************  Bit definition for CRM_CFG register  ********************/
/*!< SCLKSEL configuration */
#define CRM_CFG_SCLKSEL_Pos                 (0U)
#define CRM_CFG_SCLKSEL_Msk                 (0x3U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000003 */
#define CRM_CFG_SCLKSEL                     CRM_CFG_SCLKSEL_Msk                     /*!< SCLKSEL[1:0] bits (System clock select) */
#define CRM_CFG_SCLKSEL_0                   (0x1U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000001 */
#define CRM_CFG_SCLKSEL_1                   (0x2U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000002 */

#define CRM_CFG_SCLKSEL_HICK                0x00000000U                             /*!< HICK */
#define CRM_CFG_SCLKSEL_HEXT                0x00000001U                             /*!< HEXT */
#define CRM_CFG_SCLKSEL_PLL                 0x00000002U                             /*!< PLL */

/*!< SCLKSTS configuration */
#define CRM_CFG_SCLKSTS_Pos                 (2U)
#define CRM_CFG_SCLKSTS_Msk                 (0x3U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x0000000C */
#define CRM_CFG_SCLKSTS                     CRM_CFG_SCLKSTS_Msk                     /*!< SCLKSTS[1:0] bits (System clock select status) */
#define CRM_CFG_SCLKSTS_0                   (0x1U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x00000004 */
#define CRM_CFG_SCLKSTS_1                   (0x2U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x00000008 */

#define CRM_CFG_SCLKSTS_HICK                0x00000000U                             /*!< HICK */
#define CRM_CFG_SCLKSTS_HEXT                0x00000004U                             /*!< HEXT */
#define CRM_CFG_SCLKSTS_PLL                 0x00000008U                             /*!< PLL */

/*!< AHBDIV configuration */
#define CRM_CFG_AHBDIV_Pos                  (4U)
#define CRM_CFG_AHBDIV_Msk                  (0xFU << CRM_CFG_AHBDIV_Pos)            /*!< 0x000000F0 */
#define CRM_CFG_AHBDIV                      CRM_CFG_AHBDIV_Msk                      /*!< AHBDIV[3:0] bits (AHB division) */
#define CRM_CFG_AHBDIV_0                    (0x1U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000010 */
#define CRM_CFG_AHBDIV_1                    (0x2U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000020 */
#define CRM_CFG_AHBDIV_2                    (0x4U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000040 */
#define CRM_CFG_AHBDIV_3                    (0x8U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000080 */

#define CRM_CFG_AHBDIV_DIV1                 0x00000000U                             /*!< SCLK is not divided */
#define CRM_CFG_AHBDIV_DIV2                 0x00000080U                             /*!< SCLK is divided by 2 */
#define CRM_CFG_AHBDIV_DIV4                 0x00000090U                             /*!< SCLK is divided by 4 */
#define CRM_CFG_AHBDIV_DIV8                 0x000000A0U                             /*!< SCLK is divided by 8 */
#define CRM_CFG_AHBDIV_DIV16                0x000000B0U                             /*!< SCLK is divided by 16 */
#define CRM_CFG_AHBDIV_DIV64                0x000000C0U                             /*!< SCLK is divided by 64 */
#define CRM_CFG_AHBDIV_DIV128               0x000000D0U                             /*!< SCLK is divided by 128 */
#define CRM_CFG_AHBDIV_DIV256               0x000000E0U                             /*!< SCLK is divided by 256 */
#define CRM_CFG_AHBDIV_DIV512               0x000000F0U                             /*!< SCLK is divided by 512 */

/*!< APB1DIV configuration */
#define CRM_CFG_APB1DIV_Pos                 (10U)
#define CRM_CFG_APB1DIV_Msk                 (0x7U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00001C00 */
#define CRM_CFG_APB1DIV                     CRM_CFG_APB1DIV_Msk                     /*!< APB1DIV[2:0] bits (APB1 division) */
#define CRM_CFG_APB1DIV_0                   (0x1U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000400 */
#define CRM_CFG_APB1DIV_1                   (0x2U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000800 */
#define CRM_CFG_APB1DIV_2                   (0x4U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00001000 */

#define CRM_CFG_APB1DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB1DIV_DIV2                0x00001000U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB1DIV_DIV4                0x00001400U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB1DIV_DIV8                0x00001800U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB1DIV_DIV16               0x00001C00U                             /*!< HCLK is divided by 16 */

/*!< APB2DIV configuration */
#define CRM_CFG_APB2DIV_Pos                 (13U)
#define CRM_CFG_APB2DIV_Msk                 (0x7U << CRM_CFG_APB2DIV_Pos)           /*!< 0x0000E000 */
#define CRM_CFG_APB2DIV                     CRM_CFG_APB2DIV_Msk                     /*!< APB2DIV[2:0] bits (APB2 division) */
#define CRM_CFG_APB2DIV_0                   (0x1U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00002000 */
#define CRM_CFG_APB2DIV_1                   (0x2U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00004000 */
#define CRM_CFG_APB2DIV_2                   (0x4U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00008000 */

#define CRM_CFG_APB2DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB2DIV_DIV2                0x00008000U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB2DIV_DIV4                0x0000A000U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB2DIV_DIV8                0x0000C000U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB2DIV_DIV16               0x0000E000U                             /*!< HCLK is divided by 16 */

/*!< ERTCDIV configuration */
#define CRM_CFG_ERTCDIV_Pos                 (16U)
#define CRM_CFG_ERTCDIV_Msk                 (0x1FU << CRM_CFG_ERTCDIV_Pos)          /*!< 0x001F0000 */
#define CRM_CFG_ERTCDIV                     CRM_CFG_ERTCDIV_Msk                     /*!< ERTCDIV[4:0] bits (HEXT division for ERTC clock) */
#define CRM_CFG_ERTCDIV_0                   (0x01U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00010000 */
#define CRM_CFG_ERTCDIV_1                   (0x02U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00020000 */
#define CRM_CFG_ERTCDIV_2                   (0x04U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00040000 */
#define CRM_CFG_ERTCDIV_3                   (0x08U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00080000 */
#define CRM_CFG_ERTCDIV_4                   (0x10U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00100000 */

