qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402cx.h
/*!< IOMC15 configuration */
#define GPIO_CFGR_IOMC15_Pos                (30U)
#define GPIO_CFGR_IOMC15_Msk                (0x3U << GPIO_CFGR_IOMC15_Pos)          /*!< 0xC0000000 */
#define GPIO_CFGR_IOMC15                    GPIO_CFGR_IOMC15_Msk                    /*!< IOMC15[1:0] bits (GPIO x mode configuration, pin 15) */
#define GPIO_CFGR_IOMC15_0                  (0x1U << GPIO_CFGR_IOMC15_Pos)          /*!< 0x40000000 */
#define GPIO_CFGR_IOMC15_1                  (0x2U << GPIO_CFGR_IOMC15_Pos)          /*!< 0x80000000 */

/******************  Bit definition for GPIO_OMODE register  ******************/
#define GPIO_OMODE_OM0_Pos                  (0U)
#define GPIO_OMODE_OM0_Msk                  (0x1U << GPIO_OMODE_OM0_Pos)            /*!< 0x00000001 */
#define GPIO_OMODE_OM0                      GPIO_OMODE_OM0_Msk                      /*!< GPIO x output mode configuration, pin 0 */
#define GPIO_OMODE_OM1_Pos                  (1U)
#define GPIO_OMODE_OM1_Msk                  (0x3U << GPIO_OMODE_OM1_Pos)            /*!< 0x00000002 */
#define GPIO_OMODE_OM1                      GPIO_OMODE_OM1_Msk                      /*!< GPIO x output mode configuration, pin 1 */
#define GPIO_OMODE_OM2_Pos                  (2U)
#define GPIO_OMODE_OM2_Msk                  (0x3U << GPIO_OMODE_OM2_Pos)            /*!< 0x00000004 */
#define GPIO_OMODE_OM2                      GPIO_OMODE_OM2_Msk                      /*!< GPIO x output mode configuration, pin 2 */
#define GPIO_OMODE_OM3_Pos                  (3U)
#define GPIO_OMODE_OM3_Msk                  (0x3U << GPIO_OMODE_OM3_Pos)            /*!< 0x00000008 */
#define GPIO_OMODE_OM3                      GPIO_OMODE_OM3_Msk                      /*!< GPIO x output mode configuration, pin 3 */
#define GPIO_OMODE_OM4_Pos                  (4U)
#define GPIO_OMODE_OM4_Msk                  (0x3U << GPIO_OMODE_OM4_Pos)            /*!< 0x00000010 */
#define GPIO_OMODE_OM4                      GPIO_OMODE_OM4_Msk                      /*!< GPIO x output mode configuration, pin 4 */
#define GPIO_OMODE_OM5_Pos                  (5U)
#define GPIO_OMODE_OM5_Msk                  (0x3U << GPIO_OMODE_OM5_Pos)            /*!< 0x00000020 */
#define GPIO_OMODE_OM5                      GPIO_OMODE_OM5_Msk                      /*!< GPIO x output mode configuration, pin 5 */
#define GPIO_OMODE_OM6_Pos                  (6U)
#define GPIO_OMODE_OM6_Msk                  (0x3U << GPIO_OMODE_OM6_Pos)            /*!< 0x00000040 */
#define GPIO_OMODE_OM6                      GPIO_OMODE_OM6_Msk                      /*!< GPIO x output mode configuration, pin 6 */
#define GPIO_OMODE_OM7_Pos                  (7U)
#define GPIO_OMODE_OM7_Msk                  (0x3U << GPIO_OMODE_OM7_Pos)            /*!< 0x00000080 */
#define GPIO_OMODE_OM7                      GPIO_OMODE_OM7_Msk                      /*!< GPIO x output mode configuration, pin 7 */
#define GPIO_OMODE_OM8_Pos                  (8U)
#define GPIO_OMODE_OM8_Msk                  (0x1U << GPIO_OMODE_OM8_Pos)            /*!< 0x00000100 */
#define GPIO_OMODE_OM8                      GPIO_OMODE_OM8_Msk                      /*!< GPIO x output mode configuration, pin 8 */
#define GPIO_OMODE_OM9_Pos                  (9U)
#define GPIO_OMODE_OM9_Msk                  (0x1U << GPIO_OMODE_OM9_Pos)            /*!< 0x00000200 */
#define GPIO_OMODE_OM9                      GPIO_OMODE_OM9_Msk                      /*!< GPIO x output mode configuration, pin 9 */
#define GPIO_OMODE_OM10_Pos                 (10U)
#define GPIO_OMODE_OM10_Msk                 (0x1U << GPIO_OMODE_OM10_Pos)           /*!< 0x00000400 */
#define GPIO_OMODE_OM10                     GPIO_OMODE_OM10_Msk                     /*!< GPIO x output mode configuration, pin 10 */
#define GPIO_OMODE_OM11_Pos                 (11U)
#define GPIO_OMODE_OM11_Msk                 (0x1U << GPIO_OMODE_OM11_Pos)           /*!< 0x00000800 */
#define GPIO_OMODE_OM11                     GPIO_OMODE_OM11_Msk                     /*!< GPIO x output mode configuration, pin 11 */
#define GPIO_OMODE_OM12_Pos                 (12U)
#define GPIO_OMODE_OM12_Msk                 (0x1U << GPIO_OMODE_OM12_Pos)           /*!< 0x00001000 */
#define GPIO_OMODE_OM12                     GPIO_OMODE_OM12_Msk                     /*!< GPIO x output mode configuration, pin 12 */
#define GPIO_OMODE_OM13_Pos                 (13U)
#define GPIO_OMODE_OM13_Msk                 (0x1U << GPIO_OMODE_OM13_Pos)           /*!< 0x00002000 */
#define GPIO_OMODE_OM13                     GPIO_OMODE_OM13_Msk                     /*!< GPIO x output mode configuration, pin 13 */
#define GPIO_OMODE_OM14_Pos                 (14U)
#define GPIO_OMODE_OM14_Msk                 (0x1U << GPIO_OMODE_OM14_Pos)           /*!< 0x00004000 */
#define GPIO_OMODE_OM14                     GPIO_OMODE_OM14_Msk                     /*!< GPIO x output mode configuration, pin 14 */
#define GPIO_OMODE_OM15_Pos                 (15U)
#define GPIO_OMODE_OM15_Msk                 (0x1U << GPIO_OMODE_OM15_Pos)           /*!< 0x00008000 */
#define GPIO_OMODE_OM15                     GPIO_OMODE_OM15_Msk                     /*!< GPIO x output mode configuration, pin 15 */

/*!<***************  Bit definition for GPIO_ODRVR register  ******************/
#define GPIO_ODRVR_ODRV_Pos                 (0U)
#define GPIO_ODRVR_ODRV_Msk                 (0xFFFFFFFFU << GPIO_ODRVR_ODRV_Pos)    /*!< 0xFFFFFFFF */
#define GPIO_ODRVR_ODRV                     GPIO_ODRVR_ODRV_Msk                     /*!< GPIO x drive capability */

/*!< ODRV0 configuration */
#define GPIO_ODRVR_ODRV0_Pos                (0U)
#define GPIO_ODRVR_ODRV0_Msk                (0x3U << GPIO_ODRVR_ODRV0_Pos)          /*!< 0x00000003 */
#define GPIO_ODRVR_ODRV0                    GPIO_ODRVR_ODRV0_Msk                    /*!< ODRV0[1:0] bits (GPIO x drive capability, pin 0) */
#define GPIO_ODRVR_ODRV0_0                  (0x1U << GPIO_ODRVR_ODRV0_Pos)          /*!< 0x00000001 */
#define GPIO_ODRVR_ODRV0_1                  (0x2U << GPIO_ODRVR_ODRV0_Pos)          /*!< 0x00000002 */

/*!< ODRV1 configuration */
#define GPIO_ODRVR_ODRV1_Pos                (2U)
#define GPIO_ODRVR_ODRV1_Msk                (0x3U << GPIO_ODRVR_ODRV1_Pos)          /*!< 0x0000000C */
#define GPIO_ODRVR_ODRV1                    GPIO_ODRVR_ODRV1_Msk                    /*!< ODRV1[1:0] bits (GPIO x drive capability, pin 1) */
#define GPIO_ODRVR_ODRV1_0                  (0x1U << GPIO_ODRVR_ODRV1_Pos)          /*!< 0x00000004 */
#define GPIO_ODRVR_ODRV1_1                  (0x2U << GPIO_ODRVR_ODRV1_Pos)          /*!< 0x00000008 */

/*!< ODRV2 configuration */
#define GPIO_ODRVR_ODRV2_Pos                (4U)
#define GPIO_ODRVR_ODRV2_Msk                (0x3U << GPIO_ODRVR_ODRV2_Pos)          /*!< 0x00000030 */
#define GPIO_ODRVR_ODRV2                    GPIO_ODRVR_ODRV2_Msk                    /*!< ODRV2[1:0] bits (GPIO x drive capability, pin 2) */
#define GPIO_ODRVR_ODRV2_0                  (0x1U << GPIO_ODRVR_ODRV2_Pos)          /*!< 0x00000010 */
#define GPIO_ODRVR_ODRV2_1                  (0x2U << GPIO_ODRVR_ODRV2_Pos)          /*!< 0x00000020 */

/*!< ODRV3 configuration */
#define GPIO_ODRVR_ODRV3_Pos                (6U)
#define GPIO_ODRVR_ODRV3_Msk                (0x3U << GPIO_ODRVR_ODRV3_Pos)          /*!< 0x000000C0 */
#define GPIO_ODRVR_ODRV3                    GPIO_ODRVR_ODRV3_Msk                    /*!< ODRV3[1:0] bits (GPIO x drive capability, pin 3) */
#define GPIO_ODRVR_ODRV3_0                  (0x1U << GPIO_ODRVR_ODRV3_Pos)          /*!< 0x00000040 */
#define GPIO_ODRVR_ODRV3_1                  (0x2U << GPIO_ODRVR_ODRV3_Pos)          /*!< 0x00000080 */

/*!< ODRV4 configuration */
#define GPIO_ODRVR_ODRV4_Pos                (8U)
#define GPIO_ODRVR_ODRV4_Msk                (0x3U << GPIO_ODRVR_ODRV4_Pos)          /*!< 0x00000300 */
#define GPIO_ODRVR_ODRV4                    GPIO_ODRVR_ODRV4_Msk                    /*!< ODRV4[1:0] bits (GPIO x drive capability, pin 4) */
#define GPIO_ODRVR_ODRV4_0                  (0x1U << GPIO_ODRVR_ODRV4_Pos)          /*!< 0x00000100 */
#define GPIO_ODRVR_ODRV4_1                  (0x2U << GPIO_ODRVR_ODRV4_Pos)          /*!< 0x00000200 */

/*!< ODRV5 configuration */
#define GPIO_ODRVR_ODRV5_Pos                (10U)
#define GPIO_ODRVR_ODRV5_Msk                (0x3U << GPIO_ODRVR_ODRV5_Pos)          /*!< 0x00000C00 */
#define GPIO_ODRVR_ODRV5                    GPIO_ODRVR_ODRV5_Msk                    /*!< ODRV5[1:0] bits (GPIO x drive capability, pin 5) */
#define GPIO_ODRVR_ODRV5_0                  (0x1U << GPIO_ODRVR_ODRV5_Pos)          /*!< 0x00000400 */
#define GPIO_ODRVR_ODRV5_1                  (0x2U << GPIO_ODRVR_ODRV5_Pos)          /*!< 0x00000800 */

/*!< ODRV6 configuration */
#define GPIO_ODRVR_ODRV6_Pos                (12U)
#define GPIO_ODRVR_ODRV6_Msk                (0x3U << GPIO_ODRVR_ODRV6_Pos)          /*!< 0x00003000 */
#define GPIO_ODRVR_ODRV6                    GPIO_ODRVR_ODRV6_Msk                    /*!< ODRV6[1:0] bits (GPIO x drive capability, pin 6) */
#define GPIO_ODRVR_ODRV6_0                  (0x1U << GPIO_ODRVR_ODRV6_Pos)          /*!< 0x00001000 */
#define GPIO_ODRVR_ODRV6_1                  (0x2U << GPIO_ODRVR_ODRV6_Pos)          /*!< 0x00002000 */

