qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402cx.h
/******************  Bit definition for DMA_CPADDR register  ******************/
#define DMA_CPADDR_PADDR_Pos                (0U)
#define DMA_CPADDR_PADDR_Msk                (0xFFFFFFFFU << DMA_CPADDR_PADDR_Pos)   /*!< 0xFFFFFFFF */
#define DMA_CPADDR_PADDR                    DMA_CPADDR_PADDR_Msk                    /*!< Peripheral base address */

/******************  Bit definition for DMA_CMADDR register  ******************/
#define DMA_CMADDR_MADDR_Pos                (0U)
#define DMA_CMADDR_MADDR_Msk                (0xFFFFFFFFU << DMA_CMADDR_MADDR_Pos)   /*!< 0xFFFFFFFF */
#define DMA_CMADDR_MADDR                    DMA_CMADDR_MADDR_Msk                    /*!< Memory base address */

/******************  Bit definition for DMA_MUXSEL register  ******************/
#define DMA_MUXSEL_TBL_SEL_Pos              (0U)
#define DMA_MUXSEL_TBL_SEL_Msk              (0x1U << DMA_MUXSEL_TBL_SEL_Pos)        /*!< 0x00000001 */
#define DMA_MUXSEL_TBL_SEL                  DMA_MUXSEL_TBL_SEL_Msk                  /*!< Multiplexer table select */

/*****************  Bit definition for DMA_MUXCCTRL register  *****************/
#define DMA_MUXCCTRL_REQSEL_Pos             (0U)
#define DMA_MUXCCTRL_REQSEL_Msk             (0x7FU << DMA_MUXCCTRL_REQSEL_Pos)      /*!< 0x0000007F */
#define DMA_MUXCCTRL_REQSEL                 DMA_MUXCCTRL_REQSEL_Msk                 /*!< DMA request select */
#define DMA_MUXCCTRL_SYNCOVIEN_Pos          (8U)
#define DMA_MUXCCTRL_SYNCOVIEN_Msk          (0x1U << DMA_MUXCCTRL_SYNCOVIEN_Pos)    /*!< 0x00000100 */
#define DMA_MUXCCTRL_SYNCOVIEN              DMA_MUXCCTRL_SYNCOVIEN_Msk              /*!< Synchronization overrun interrupt enable */
#define DMA_MUXCCTRL_EVTGEN_Pos             (9U)
#define DMA_MUXCCTRL_EVTGEN_Msk             (0x1U << DMA_MUXCCTRL_EVTGEN_Pos)       /*!< 0x00000200 */
#define DMA_MUXCCTRL_EVTGEN                 DMA_MUXCCTRL_EVTGEN_Msk                 /*!< Event generate enable */
#define DMA_MUXCCTRL_SYNCEN_Pos             (16U)
#define DMA_MUXCCTRL_SYNCEN_Msk             (0x1U << DMA_MUXCCTRL_SYNCEN_Pos)       /*!< 0x00010000 */
#define DMA_MUXCCTRL_SYNCEN                 DMA_MUXCCTRL_SYNCEN_Msk                 /*!< Synchronization enable */

/*!< SYNCPOL configuration */
#define DMA_MUXCCTRL_SYNCPOL_Pos            (17U)
#define DMA_MUXCCTRL_SYNCPOL_Msk            (0x3U << DMA_MUXCCTRL_SYNCPOL_Pos)      /*!< 0x00060000 */
#define DMA_MUXCCTRL_SYNCPOL                DMA_MUXCCTRL_SYNCPOL_Msk                /*!< SYNCPOL[1:0] bits (Synchronization polarity) */
#define DMA_MUXCCTRL_SYNCPOL_0              (0x1U << DMA_MUXCCTRL_SYNCPOL_Pos)      /*!< 0x00020000 */
#define DMA_MUXCCTRL_SYNCPOL_1              (0x2U << DMA_MUXCCTRL_SYNCPOL_Pos)      /*!< 0x00040000 */

/*!< REQCNT configuration */
#define DMA_MUXCCTRL_REQCNT_Pos             (19U)
#define DMA_MUXCCTRL_REQCNT_Msk             (0x1FU << DMA_MUXCCTRL_REQCNT_Pos)      /*!< 0x00F80000 */
#define DMA_MUXCCTRL_REQCNT                 DMA_MUXCCTRL_REQCNT_Msk                 /*!< REQCNT[4:0] bits (DMA request count) */
#define DMA_MUXCCTRL_REQCNT_0               (0x1U << DMA_MUXCCTRL_REQCNT_Pos)       /*!< 0x00080000 */
#define DMA_MUXCCTRL_REQCNT_1               (0x2U << DMA_MUXCCTRL_REQCNT_Pos)       /*!< 0x00100000 */
#define DMA_MUXCCTRL_REQCNT_2               (0x4U << DMA_MUXCCTRL_REQCNT_Pos)       /*!< 0x00200000 */
#define DMA_MUXCCTRL_REQCNT_3               (0x8U << DMA_MUXCCTRL_REQCNT_Pos)       /*!< 0x00400000 */
#define DMA_MUXCCTRL_REQCNT_4               (0x10U << DMA_MUXCCTRL_REQCNT_Pos)      /*!< 0x00800000 */

/*!< SYNCSEL configuration */
#define DMA_MUXCCTRL_SYNCSEL_Pos            (24U)
#define DMA_MUXCCTRL_SYNCSEL_Msk            (0x1FU << DMA_MUXCCTRL_SYNCSEL_Pos)     /*!< 0x1F000000 */
#define DMA_MUXCCTRL_SYNCSEL                DMA_MUXCCTRL_SYNCSEL_Msk                /*!< SYNCSEL[4:0] bits (Synchronization select) */
#define DMA_MUXCCTRL_SYNCSEL_0              (0x1U << DMA_MUXCCTRL_SYNCSEL_Pos)      /*!< 0x01000000 */
#define DMA_MUXCCTRL_SYNCSEL_1              (0x2U << DMA_MUXCCTRL_SYNCSEL_Pos)      /*!< 0x02000000 */
#define DMA_MUXCCTRL_SYNCSEL_2              (0x4U << DMA_MUXCCTRL_SYNCSEL_Pos)      /*!< 0x04000000 */
#define DMA_MUXCCTRL_SYNCSEL_3              (0x8U << DMA_MUXCCTRL_SYNCSEL_Pos)      /*!< 0x08000000 */
#define DMA_MUXCCTRL_SYNCSEL_4              (0x10U << DMA_MUXCCTRL_SYNCSEL_Pos)     /*!< 0x10000000 */

/*****************  Bit definition for DMA_MUXGCTRL register  *****************/
#define DMA_MUXGCTRL_SIGSEL_Pos             (0U)
#define DMA_MUXGCTRL_SIGSEL_Msk             (0x1FU << DMA_MUXGCTRL_SIGSEL_Pos)      /*!< 0x0000001F */
#define DMA_MUXGCTRL_SIGSEL                 DMA_MUXGCTRL_SIGSEL_Msk                 /*!< Signal select */
#define DMA_MUXGCTRL_TRGOVIEN_Pos           (8U)
#define DMA_MUXGCTRL_TRGOVIEN_Msk           (0x1U << DMA_MUXGCTRL_TRGOVIEN_Pos)     /*!< 0x00000100 */
#define DMA_MUXGCTRL_TRGOVIEN               DMA_MUXGCTRL_TRGOVIEN_Msk               /*!< Trigger overrun interrupt enable */
#define DMA_MUXGCTRL_GEN_Pos                (16U)
#define DMA_MUXGCTRL_GEN_Msk                (0x1U << DMA_MUXGCTRL_GEN_Pos)          /*!< 0x00010000 */
#define DMA_MUXGCTRL_GEN                    DMA_MUXGCTRL_GEN_Msk                    /*!< DMA request generation enable */

/*!< GPOL configuration */
#define DMA_MUXGCTRL_GPOL_Pos               (17U)
#define DMA_MUXGCTRL_GPOL_Msk               (0x3U << DMA_MUXGCTRL_GPOL_Pos)         /*!< 0x00060000 */
#define DMA_MUXGCTRL_GPOL                   DMA_MUXGCTRL_GPOL_Msk                   /*!< GPOL[1:0] bits (DMA request generation polarity) */
#define DMA_MUXGCTRL_GPOL_0                 (0x1U << DMA_MUXGCTRL_GPOL_Pos)         /*!< 0x00020000 */
#define DMA_MUXGCTRL_GPOL_1                 (0x2U << DMA_MUXGCTRL_GPOL_Pos)         /*!< 0x00040000 */

/*!< GREQCNT configuration */
#define DMA_MUXGCTRL_GREQCNT_Pos            (19U)
#define DMA_MUXGCTRL_GREQCNT_Msk            (0x1FU << DMA_MUXGCTRL_GREQCNT_Pos)     /*!< 0x00F80000 */
#define DMA_MUXGCTRL_GREQCNT                DMA_MUXGCTRL_GREQCNT_Msk                /*!< GREQCNT[4:0] bits (DMA request generation count) */
#define DMA_MUXGCTRL_GREQCNT_0              (0x1U << DMA_MUXGCTRL_GREQCNT_Pos)      /*!< 0x00080000 */
#define DMA_MUXGCTRL_GREQCNT_1              (0x2U << DMA_MUXGCTRL_GREQCNT_Pos)      /*!< 0x00100000 */
#define DMA_MUXGCTRL_GREQCNT_2              (0x4U << DMA_MUXGCTRL_GREQCNT_Pos)      /*!< 0x00200000 */
#define DMA_MUXGCTRL_GREQCNT_3              (0x8U << DMA_MUXGCTRL_GREQCNT_Pos)      /*!< 0x00400000 */
#define DMA_MUXGCTRL_GREQCNT_4              (0x10U << DMA_MUXGCTRL_GREQCNT_Pos)     /*!< 0x00800000 */

