qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402cx.h
/*!< CAN control and status registers */
/******************  Bit definition for CAN_MCTRL register  *******************/
#define CAN_MCTRL_FZEN_Pos                  (0U)
#define CAN_MCTRL_FZEN_Msk                  (0x1U << CAN_MCTRL_FZEN_Pos)            /*!< 0x00000001 */
#define CAN_MCTRL_FZEN                      CAN_MCTRL_FZEN_Msk                      /*!< Freeze mode enable */
#define CAN_MCTRL_DZEN_Pos                  (1U)
#define CAN_MCTRL_DZEN_Msk                  (0x1U << CAN_MCTRL_DZEN_Pos)            /*!< 0x00000002 */
#define CAN_MCTRL_DZEN                      CAN_MCTRL_DZEN_Msk                      /*!< Doze mode enable */
#define CAN_MCTRL_MMSSR_Pos                 (2U)
#define CAN_MCTRL_MMSSR_Msk                 (0x1U << CAN_MCTRL_MMSSR_Pos)           /*!< 0x00000004 */
#define CAN_MCTRL_MMSSR                     CAN_MCTRL_MMSSR_Msk                     /*!< Multiple message transmit sequence rule */
#define CAN_MCTRL_MDRSEL_Pos                (3U)
#define CAN_MCTRL_MDRSEL_Msk                (0x1U << CAN_MCTRL_MDRSEL_Pos)          /*!< 0x00000008 */
#define CAN_MCTRL_MDRSEL                    CAN_MCTRL_MDRSEL_Msk                    /*!< Message discard rule select when overflow */
#define CAN_MCTRL_PRSFEN_Pos                (4U)
#define CAN_MCTRL_PRSFEN_Msk                (0x1U << CAN_MCTRL_PRSFEN_Pos)          /*!< 0x00000010 */
#define CAN_MCTRL_PRSFEN                    CAN_MCTRL_PRSFEN_Msk                    /*!< Prohibit retransmission enable when sending fails enable */
#define CAN_MCTRL_AEDEN_Pos                 (5U)
#define CAN_MCTRL_AEDEN_Msk                 (0x1U << CAN_MCTRL_AEDEN_Pos)           /*!< 0x00000020 */
#define CAN_MCTRL_AEDEN                     CAN_MCTRL_AEDEN_Msk                     /*!< Automatic exit doze mode enable */
#define CAN_MCTRL_AEBOEN_Pos                (6U)
#define CAN_MCTRL_AEBOEN_Msk                (0x1U << CAN_MCTRL_AEBOEN_Pos)          /*!< 0x00000040 */
#define CAN_MCTRL_AEBOEN                    CAN_MCTRL_AEBOEN_Msk                    /*!< Automatic exit bus-off enable */
#define CAN_MCTRL_TTCEN_Pos                 (7U)
#define CAN_MCTRL_TTCEN_Msk                 (0x1U << CAN_MCTRL_TTCEN_Pos)           /*!< 0x00000080 */
#define CAN_MCTRL_TTCEN                     CAN_MCTRL_TTCEN_Msk                     /*!< Time triggered communication mode enable */
#define CAN_MCTRL_SPRST_Pos                 (15U)
#define CAN_MCTRL_SPRST_Msk                 (0x1U << CAN_MCTRL_SPRST_Pos)           /*!< 0x00008000 */
#define CAN_MCTRL_SPRST                     CAN_MCTRL_SPRST_Msk                     /*!< Software partial reset */
#define CAN_MCTRL_PTD_Pos                   (16U)
#define CAN_MCTRL_PTD_Msk                   (0x1U << CAN_MCTRL_PTD_Pos)             /*!< 0x00010000 */
#define CAN_MCTRL_PTD                       CAN_MCTRL_PTD_Msk                       /*!< Prohibit trans when debug */

/*******************  Bit definition for CAN_MSTS register  *******************/
#define CAN_MSTS_FZC_Pos                    (0U)
#define CAN_MSTS_FZC_Msk                    (0x1U << CAN_MSTS_FZC_Pos)              /*!< 0x00000001 */
#define CAN_MSTS_FZC                        CAN_MSTS_FZC_Msk                        /*!< Freeze mode confirm */
#define CAN_MSTS_DZC_Pos                    (1U)
#define CAN_MSTS_DZC_Msk                    (0x1U << CAN_MSTS_DZC_Pos)              /*!< 0x00000002 */
#define CAN_MSTS_DZC                        CAN_MSTS_DZC_Msk                        /*!< Doze mode acknowledge */
#define CAN_MSTS_EOIF_Pos                   (2U)
#define CAN_MSTS_EOIF_Msk                   (0x1U << CAN_MSTS_EOIF_Pos)             /*!< 0x00000004 */
#define CAN_MSTS_EOIF                       CAN_MSTS_EOIF_Msk                       /*!< Error occur interrupt flag */
#define CAN_MSTS_QDZIF_Pos                  (3U)
#define CAN_MSTS_QDZIF_Msk                  (0x1U << CAN_MSTS_QDZIF_Pos)            /*!< 0x00000008 */
#define CAN_MSTS_QDZIF                      CAN_MSTS_QDZIF_Msk                      /*!< Exit doze mode interrupt flag */
#define CAN_MSTS_EDZIF_Pos                  (4U)
#define CAN_MSTS_EDZIF_Msk                  (0x1U << CAN_MSTS_EDZIF_Pos)            /*!< 0x00000010 */
#define CAN_MSTS_EDZIF                      CAN_MSTS_EDZIF_Msk                      /*!< Enter doze mode interrupt flag */
#define CAN_MSTS_CUSS_Pos                   (8U)
#define CAN_MSTS_CUSS_Msk                   (0x1U << CAN_MSTS_CUSS_Pos)             /*!< 0x00000100 */
#define CAN_MSTS_CUSS                       CAN_MSTS_CUSS_Msk                       /*!< Current transmit status */
#define CAN_MSTS_CURS_Pos                   (9U)
#define CAN_MSTS_CURS_Msk                   (0x1U << CAN_MSTS_CURS_Pos)             /*!< 0x00000200 */
#define CAN_MSTS_CURS                       CAN_MSTS_CURS_Msk                       /*!< Current receive status */
#define CAN_MSTS_LSAMPRX_Pos                (10U)
#define CAN_MSTS_LSAMPRX_Msk                (0x1U << CAN_MSTS_LSAMPRX_Pos)          /*!< 0x00000400 */
#define CAN_MSTS_LSAMPRX                    CAN_MSTS_LSAMPRX_Msk                    /*!< Last sample level on RX pin */
#define CAN_MSTS_REALRX_Pos                 (11U)
#define CAN_MSTS_REALRX_Msk                 (0x1U << CAN_MSTS_REALRX_Pos)           /*!< 0x00000800 */
#define CAN_MSTS_REALRX                     CAN_MSTS_REALRX_Msk                     /*!< Real time level on RX pin */

/*******************  Bit definition for CAN_TSTS register  *******************/
#define CAN_TSTS_TM0TCF_Pos                 (0U)
#define CAN_TSTS_TM0TCF_Msk                 (0x1U << CAN_TSTS_TM0TCF_Pos)           /*!< 0x00000001 */
#define CAN_TSTS_TM0TCF                     CAN_TSTS_TM0TCF_Msk                     /*!< Transmit mailbox 0 transmission completed flag */
#define CAN_TSTS_TM0TSF_Pos                 (1U)
#define CAN_TSTS_TM0TSF_Msk                 (0x1U << CAN_TSTS_TM0TSF_Pos)           /*!< 0x00000002 */
#define CAN_TSTS_TM0TSF                     CAN_TSTS_TM0TSF_Msk                     /*!< Transmit mailbox 0 transmission success flag */
#define CAN_TSTS_TM0ALF_Pos                 (2U)
#define CAN_TSTS_TM0ALF_Msk                 (0x1U << CAN_TSTS_TM0ALF_Pos)           /*!< 0x00000004 */
#define CAN_TSTS_TM0ALF                     CAN_TSTS_TM0ALF_Msk                     /*!< Transmit mailbox 0 arbitration lost flag */
#define CAN_TSTS_TM0TEF_Pos                 (3U)
#define CAN_TSTS_TM0TEF_Msk                 (0x1U << CAN_TSTS_TM0TEF_Pos)           /*!< 0x00000008 */
#define CAN_TSTS_TM0TEF                     CAN_TSTS_TM0TEF_Msk                     /*!< Transmit mailbox 0 transmission error flag */
#define CAN_TSTS_TM0CT_Pos                  (7U)
#define CAN_TSTS_TM0CT_Msk                  (0x1U << CAN_TSTS_TM0CT_Pos)            /*!< 0x00000080 */
#define CAN_TSTS_TM0CT                      CAN_TSTS_TM0CT_Msk                      /*!< Transmit mailbox 0 cancel transmit */
#define CAN_TSTS_TM1TCF_Pos                 (8U)
#define CAN_TSTS_TM1TCF_Msk                 (0x1U << CAN_TSTS_TM1TCF_Pos)           /*!< 0x00000100 */
#define CAN_TSTS_TM1TCF                     CAN_TSTS_TM1TCF_Msk                     /*!< Transmit mailbox 1 transmission completed flag */
#define CAN_TSTS_TM1TSF_Pos                 (9U)
#define CAN_TSTS_TM1TSF_Msk                 (0x1U << CAN_TSTS_TM1TSF_Pos)           /*!< 0x00000200 */
#define CAN_TSTS_TM1TSF                     CAN_TSTS_TM1TSF_Msk                     /*!< Transmit mailbox 1 transmission success flag */
#define CAN_TSTS_TM1ALF_Pos                 (10U)
#define CAN_TSTS_TM1ALF_Msk                 (0x1U << CAN_TSTS_TM1ALF_Pos)           /*!< 0x00000400 */
#define CAN_TSTS_TM1ALF                     CAN_TSTS_TM1ALF_Msk                     /*!< Transmit mailbox 1 arbitration lost flag */
#define CAN_TSTS_TM1TEF_Pos                 (11U)
#define CAN_TSTS_TM1TEF_Msk                 (0x1U << CAN_TSTS_TM1TEF_Pos)           /*!< 0x00000800 */
#define CAN_TSTS_TM1TEF                     CAN_TSTS_TM1TEF_Msk                     /*!< Transmit mailbox 1 transmission error flag */
#define CAN_TSTS_TM1CT_Pos                  (15U)
#define CAN_TSTS_TM1CT_Msk                  (0x1U << CAN_TSTS_TM1CT_Pos)            /*!< 0x00008000 */
#define CAN_TSTS_TM1CT                      CAN_TSTS_TM1CT_Msk                      /*!< Transmit mailbox 1 cancel transmit */
#define CAN_TSTS_TM2TCF_Pos                 (16U)
#define CAN_TSTS_TM2TCF_Msk                 (0x1U << CAN_TSTS_TM2TCF_Pos)           /*!< 0x00010000 */
#define CAN_TSTS_TM2TCF                     CAN_TSTS_TM2TCF_Msk                     /*!< Transmit mailbox 2 transmission completed flag */
#define CAN_TSTS_TM2TSF_Pos                 (17U)
#define CAN_TSTS_TM2TSF_Msk                 (0x1U << CAN_TSTS_TM2TSF_Pos)           /*!< 0x00020000 */
#define CAN_TSTS_TM2TSF                     CAN_TSTS_TM2TSF_Msk                     /*!< Transmit mailbox 2 transmission success flag */
#define CAN_TSTS_TM2ALF_Pos                 (18U)
#define CAN_TSTS_TM2ALF_Msk                 (0x1U << CAN_TSTS_TM2ALF_Pos)           /*!< 0x00040000 */
#define CAN_TSTS_TM2ALF                     CAN_TSTS_TM2ALF_Msk                     /*!< Transmit mailbox 2 arbitration lost flag */
#define CAN_TSTS_TM2TEF_Pos                 (19U)
#define CAN_TSTS_TM2TEF_Msk                 (0x1U << CAN_TSTS_TM2TEF_Pos)           /*!< 0x00080000 */
#define CAN_TSTS_TM2TEF                     CAN_TSTS_TM2TEF_Msk                     /*!< Transmit mailbox 2 transmission error flag */
#define CAN_TSTS_TM2CT_Pos                  (23U)
#define CAN_TSTS_TM2CT_Msk                  (0x1U << CAN_TSTS_TM2CT_Pos)            /*!< 0x00800000 */
#define CAN_TSTS_TM2CT                      CAN_TSTS_TM2CT_Msk                      /*!< Transmit mailbox 2 cancel transmit */
#define CAN_TSTS_TMNR_Pos                   (24U)
#define CAN_TSTS_TMNR_Msk                   (0x3U << CAN_TSTS_TMNR_Pos)             /*!< 0x03000000 */
#define CAN_TSTS_TMNR                       CAN_TSTS_TMNR_Msk                       /*!< TMNR[1:0] bits (Transmit mailbox number record) */

/*!< TMEF congiguration */
#define CAN_TSTS_TMEF_Pos                   (26U)
#define CAN_TSTS_TMEF_Msk                   (0x7U << CAN_TSTS_TMEF_Pos)             /*!< 0x1C000000 */
#define CAN_TSTS_TMEF                       CAN_TSTS_TMEF_Msk                       /*!< TMEF[2:0] bits (Transmit mailbox empty flag) */
#define CAN_TSTS_TM0EF_Pos                  (26U)
#define CAN_TSTS_TM0EF_Msk                  (0x1U << CAN_TSTS_TM0EF_Pos)            /*!< 0x04000000 */
#define CAN_TSTS_TM0EF                      CAN_TSTS_TM0EF_Msk                      /*!< Transmit mailbox 0 empty flag */
#define CAN_TSTS_TM1EF_Pos                  (27U)
#define CAN_TSTS_TM1EF_Msk                  (0x1U << CAN_TSTS_TM1EF_Pos)            /*!< 0x08000000 */
#define CAN_TSTS_TM1EF                      CAN_TSTS_TM1EF_Msk                      /*!< Transmit mailbox 1 empty flag */
#define CAN_TSTS_TM2EF_Pos                  (28U)
#define CAN_TSTS_TM2EF_Msk                  (0x1U << CAN_TSTS_TM2EF_Pos)            /*!< 0x10000000 */
#define CAN_TSTS_TM2EF                      CAN_TSTS_TM2EF_Msk                      /*!< Transmit mailbox 2 empty flag */

