qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402cx.h
/*******************  Bit definition for CAN_FRF register  ********************/
#define CAN_FRF_FRFSEL_Pos                  (0U)
#define CAN_FRF_FRFSEL_Msk                  (0xFFFFFFFU << CAN_FRF_FRFSEL_Pos)      /*!< 0x0FFFFFFF */
#define CAN_FRF_FRFSEL                      CAN_FRF_FRFSEL_Msk                      /*!< Filter relation FIFO select */
#define CAN_FRF_FRFSEL0_Pos                 (0U)
#define CAN_FRF_FRFSEL0_Msk                 (0x1U << CAN_FRF_FRFSEL0_Pos)           /*!< 0x00000001 */
#define CAN_FRF_FRFSEL0                     CAN_FRF_FRFSEL0_Msk                     /*!< Filter relation FIFO select for filter 0 */
#define CAN_FRF_FRFSEL1_Pos                 (1U)
#define CAN_FRF_FRFSEL1_Msk                 (0x1U << CAN_FRF_FRFSEL1_Pos)           /*!< 0x00000002 */
#define CAN_FRF_FRFSEL1                     CAN_FRF_FRFSEL1_Msk                     /*!< Filter relation FIFO select for filter 1 */
#define CAN_FRF_FRFSEL2_Pos                 (2U)
#define CAN_FRF_FRFSEL2_Msk                 (0x1U << CAN_FRF_FRFSEL2_Pos)           /*!< 0x00000004 */
#define CAN_FRF_FRFSEL2                     CAN_FRF_FRFSEL2_Msk                     /*!< Filter relation FIFO select for filter 2 */
#define CAN_FRF_FRFSEL3_Pos                 (3U)
#define CAN_FRF_FRFSEL3_Msk                 (0x1U << CAN_FRF_FRFSEL3_Pos)           /*!< 0x00000008 */
#define CAN_FRF_FRFSEL3                     CAN_FRF_FRFSEL3_Msk                     /*!< Filter relation FIFO select for filter 3 */
#define CAN_FRF_FRFSEL4_Pos                 (4U)
#define CAN_FRF_FRFSEL4_Msk                 (0x1U << CAN_FRF_FRFSEL4_Pos)           /*!< 0x00000010 */
#define CAN_FRF_FRFSEL4                     CAN_FRF_FRFSEL4_Msk                     /*!< Filter relation FIFO select for filter 4 */
#define CAN_FRF_FRFSEL5_Pos                 (5U)
#define CAN_FRF_FRFSEL5_Msk                 (0x1U << CAN_FRF_FRFSEL5_Pos)           /*!< 0x00000020 */
#define CAN_FRF_FRFSEL5                     CAN_FRF_FRFSEL5_Msk                     /*!< Filter relation FIFO select for filter 5 */
#define CAN_FRF_FRFSEL6_Pos                 (6U)
#define CAN_FRF_FRFSEL6_Msk                 (0x1U << CAN_FRF_FRFSEL6_Pos)           /*!< 0x00000040 */
#define CAN_FRF_FRFSEL6                     CAN_FRF_FRFSEL6_Msk                     /*!< Filter relation FIFO select for filter 6 */
#define CAN_FRF_FRFSEL7_Pos                 (7U)
#define CAN_FRF_FRFSEL7_Msk                 (0x1U << CAN_FRF_FRFSEL7_Pos)           /*!< 0x00000080 */
#define CAN_FRF_FRFSEL7                     CAN_FRF_FRFSEL7_Msk                     /*!< Filter relation FIFO select for filter 7 */
#define CAN_FRF_FRFSEL8_Pos                 (8U)
#define CAN_FRF_FRFSEL8_Msk                 (0x1U << CAN_FRF_FRFSEL8_Pos)           /*!< 0x00000100 */
#define CAN_FRF_FRFSEL8                     CAN_FRF_FRFSEL8_Msk                     /*!< Filter relation FIFO select for filter 8 */
#define CAN_FRF_FRFSEL9_Pos                 (9U)
#define CAN_FRF_FRFSEL9_Msk                 (0x1U << CAN_FRF_FRFSEL9_Pos)           /*!< 0x00000200 */
#define CAN_FRF_FRFSEL9                     CAN_FRF_FRFSEL9_Msk                     /*!< Filter relation FIFO select for filter 9 */
#define CAN_FRF_FRFSEL10_Pos                (10U)
#define CAN_FRF_FRFSEL10_Msk                (0x1U << CAN_FRF_FRFSEL10_Pos)          /*!< 0x00000400 */
#define CAN_FRF_FRFSEL10                    CAN_FRF_FRFSEL10_Msk                    /*!< Filter relation FIFO select for filter 10 */
#define CAN_FRF_FRFSEL11_Pos                (11U)
#define CAN_FRF_FRFSEL11_Msk                (0x1U << CAN_FRF_FRFSEL11_Pos)          /*!< 0x00000800 */
#define CAN_FRF_FRFSEL11                    CAN_FRF_FRFSEL11_Msk                    /*!< Filter relation FIFO select for filter 11 */
#define CAN_FRF_FRFSEL12_Pos                (12U)
#define CAN_FRF_FRFSEL12_Msk                (0x1U << CAN_FRF_FRFSEL12_Pos)          /*!< 0x00001000 */
#define CAN_FRF_FRFSEL12                    CAN_FRF_FRFSEL12_Msk                    /*!< Filter relation FIFO select for filter 12 */
#define CAN_FRF_FRFSEL13_Pos                (13U)
#define CAN_FRF_FRFSEL13_Msk                (0x1U << CAN_FRF_FRFSEL13_Pos)          /*!< 0x00002000 */
#define CAN_FRF_FRFSEL13                    CAN_FRF_FRFSEL13_Msk                    /*!< Filter relation FIFO select for filter 13 */
#define CAN_FRF_FRFSEL14_Pos                (14U)
#define CAN_FRF_FRFSEL14_Msk                (0x1U << CAN_FRF_FRFSEL14_Pos)          /*!< 0x00004000 */
#define CAN_FRF_FRFSEL14                    CAN_FRF_FRFSEL14_Msk                    /*!< Filter relation FIFO select for filter 14 */
#define CAN_FRF_FRFSEL15_Pos                (15U)
#define CAN_FRF_FRFSEL15_Msk                (0x1U << CAN_FRF_FRFSEL15_Pos)          /*!< 0x00008000 */
#define CAN_FRF_FRFSEL15                    CAN_FRF_FRFSEL15_Msk                    /*!< Filter relation FIFO select for filter 15 */
#define CAN_FRF_FRFSEL16_Pos                (16U)
#define CAN_FRF_FRFSEL16_Msk                (0x1U << CAN_FRF_FRFSEL16_Pos)          /*!< 0x00010000 */
#define CAN_FRF_FRFSEL16                    CAN_FRF_FRFSEL16_Msk                    /*!< Filter relation FIFO select for filter 16 */
#define CAN_FRF_FRFSEL17_Pos                (17U)
#define CAN_FRF_FRFSEL17_Msk                (0x1U << CAN_FRF_FRFSEL17_Pos)          /*!< 0x00020000 */
#define CAN_FRF_FRFSEL17                    CAN_FRF_FRFSEL17_Msk                    /*!< Filter relation FIFO select for filter 17 */
#define CAN_FRF_FRFSEL18_Pos                (18U)
#define CAN_FRF_FRFSEL18_Msk                (0x1U << CAN_FRF_FRFSEL18_Pos)          /*!< 0x00040000 */
#define CAN_FRF_FRFSEL18                    CAN_FRF_FRFSEL18_Msk                    /*!< Filter relation FIFO select for filter 18 */
#define CAN_FRF_FRFSEL19_Pos                (19U)
#define CAN_FRF_FRFSEL19_Msk                (0x1U << CAN_FRF_FRFSEL19_Pos)          /*!< 0x00080000 */
#define CAN_FRF_FRFSEL19                    CAN_FRF_FRFSEL19_Msk                    /*!< Filter relation FIFO select for filter 19 */
#define CAN_FRF_FRFSEL20_Pos                (20U)
#define CAN_FRF_FRFSEL20_Msk                (0x1U << CAN_FRF_FRFSEL20_Pos)          /*!< 0x00100000 */
#define CAN_FRF_FRFSEL20                    CAN_FRF_FRFSEL20_Msk                    /*!< Filter relation FIFO select for filter 20 */
#define CAN_FRF_FRFSEL21_Pos                (21U)
#define CAN_FRF_FRFSEL21_Msk                (0x1U << CAN_FRF_FRFSEL21_Pos)          /*!< 0x00200000 */
#define CAN_FRF_FRFSEL21                    CAN_FRF_FRFSEL21_Msk                    /*!< Filter relation FIFO select for filter 21 */
#define CAN_FRF_FRFSEL22_Pos                (22U)
#define CAN_FRF_FRFSEL22_Msk                (0x1U << CAN_FRF_FRFSEL22_Pos)          /*!< 0x00400000 */
#define CAN_FRF_FRFSEL22                    CAN_FRF_FRFSEL22_Msk                    /*!< Filter relation FIFO select for filter 22 */
#define CAN_FRF_FRFSEL23_Pos                (23U)
#define CAN_FRF_FRFSEL23_Msk                (0x1U << CAN_FRF_FRFSEL23_Pos)          /*!< 0x00800000 */
#define CAN_FRF_FRFSEL23                    CAN_FRF_FRFSEL23_Msk                    /*!< Filter relation FIFO select for filter 23 */
#define CAN_FRF_FRFSEL24_Pos                (24U)
#define CAN_FRF_FRFSEL24_Msk                (0x1U << CAN_FRF_FRFSEL24_Pos)          /*!< 0x01000000 */
#define CAN_FRF_FRFSEL24                    CAN_FRF_FRFSEL24_Msk                    /*!< Filter relation FIFO select for filter 24 */
#define CAN_FRF_FRFSEL25_Pos                (25U)
#define CAN_FRF_FRFSEL25_Msk                (0x1U << CAN_FRF_FRFSEL25_Pos)          /*!< 0x02000000 */
#define CAN_FRF_FRFSEL25                    CAN_FRF_FRFSEL25_Msk                    /*!< Filter relation FIFO select for filter 25 */
#define CAN_FRF_FRFSEL26_Pos                (26U)
#define CAN_FRF_FRFSEL26_Msk                (0x1U << CAN_FRF_FRFSEL26_Pos)          /*!< 0x04000000 */
#define CAN_FRF_FRFSEL26                    CAN_FRF_FRFSEL26_Msk                    /*!< Filter relation FIFO select for filter 26 */
#define CAN_FRF_FRFSEL27_Pos                (27U)
#define CAN_FRF_FRFSEL27_Msk                (0x1U << CAN_FRF_FRFSEL27_Pos)          /*!< 0x08000000 */
#define CAN_FRF_FRFSEL27                    CAN_FRF_FRFSEL27_Msk                    /*!< Filter relation FIFO select for filter 27 */

/******************  Bit definition for CAN_FACFG register  *******************/
#define CAN_FACFG_FAEN_Pos                  (0U)
#define CAN_FACFG_FAEN_Msk                  (0xFFFFFFFU << CAN_FACFG_FAEN_Pos)      /*!< 0x0FFFFFFF */
#define CAN_FACFG_FAEN                      CAN_FACFG_FAEN_Msk                      /*!< Filter active enable */
#define CAN_FACFG_FAEN0_Pos                 (0U)
#define CAN_FACFG_FAEN0_Msk                 (0x1U << CAN_FACFG_FAEN0_Pos)           /*!< 0x00000001 */
#define CAN_FACFG_FAEN0                     CAN_FACFG_FAEN0_Msk                     /*!< Filter 0 active enable */
#define CAN_FACFG_FAEN1_Pos                 (1U)
#define CAN_FACFG_FAEN1_Msk                 (0x1U << CAN_FACFG_FAEN1_Pos)           /*!< 0x00000002 */
#define CAN_FACFG_FAEN1                     CAN_FACFG_FAEN1_Msk                     /*!< Filter 1 active enable */
#define CAN_FACFG_FAEN2_Pos                 (2U)
#define CAN_FACFG_FAEN2_Msk                 (0x1U << CAN_FACFG_FAEN2_Pos)           /*!< 0x00000004 */
#define CAN_FACFG_FAEN2                     CAN_FACFG_FAEN2_Msk                     /*!< Filter 2 active enable */
#define CAN_FACFG_FAEN3_Pos                 (3U)
#define CAN_FACFG_FAEN3_Msk                 (0x1U << CAN_FACFG_FAEN3_Pos)           /*!< 0x00000008 */
#define CAN_FACFG_FAEN3                     CAN_FACFG_FAEN3_Msk                     /*!< Filter 3 active enable */
#define CAN_FACFG_FAEN4_Pos                 (4U)
#define CAN_FACFG_FAEN4_Msk                 (0x1U << CAN_FACFG_FAEN4_Pos)           /*!< 0x00000010 */
#define CAN_FACFG_FAEN4                     CAN_FACFG_FAEN4_Msk                     /*!< Filter 4 active enable */
#define CAN_FACFG_FAEN5_Pos                 (5U)
#define CAN_FACFG_FAEN5_Msk                 (0x1U << CAN_FACFG_FAEN5_Pos)           /*!< 0x00000020 */
#define CAN_FACFG_FAEN5                     CAN_FACFG_FAEN5_Msk                     /*!< Filter 5 active enable */
#define CAN_FACFG_FAEN6_Pos                 (6U)
#define CAN_FACFG_FAEN6_Msk                 (0x1U << CAN_FACFG_FAEN6_Pos)           /*!< 0x00000040 */
#define CAN_FACFG_FAEN6                     CAN_FACFG_FAEN6_Msk                     /*!< Filter 6 active enable */
#define CAN_FACFG_FAEN7_Pos                 (7U)
#define CAN_FACFG_FAEN7_Msk                 (0x1U << CAN_FACFG_FAEN7_Pos)           /*!< 0x00000080 */
#define CAN_FACFG_FAEN7                     CAN_FACFG_FAEN7_Msk                     /*!< Filter 7 active enable */
#define CAN_FACFG_FAEN8_Pos                 (8U)
#define CAN_FACFG_FAEN8_Msk                 (0x1U << CAN_FACFG_FAEN8_Pos)           /*!< 0x00000100 */
#define CAN_FACFG_FAEN8                     CAN_FACFG_FAEN8_Msk                     /*!< Filter 8 active enable */
#define CAN_FACFG_FAEN9_Pos                 (9U)
#define CAN_FACFG_FAEN9_Msk                 (0x1U << CAN_FACFG_FAEN9_Pos)           /*!< 0x00000200 */
#define CAN_FACFG_FAEN9                     CAN_FACFG_FAEN9_Msk                     /*!< Filter 9 active enable */
#define CAN_FACFG_FAEN10_Pos                (10U)
#define CAN_FACFG_FAEN10_Msk                (0x1U << CAN_FACFG_FAEN10_Pos)          /*!< 0x00000400 */
#define CAN_FACFG_FAEN10                    CAN_FACFG_FAEN10_Msk                    /*!< Filter 10 active enable */
#define CAN_FACFG_FAEN11_Pos                (11U)
#define CAN_FACFG_FAEN11_Msk                (0x1U << CAN_FACFG_FAEN11_Pos)          /*!< 0x00000800 */
#define CAN_FACFG_FAEN11                    CAN_FACFG_FAEN11_Msk                    /*!< Filter 11 active enable */
#define CAN_FACFG_FAEN12_Pos                (12U)
#define CAN_FACFG_FAEN12_Msk                (0x1U << CAN_FACFG_FAEN12_Pos)          /*!< 0x00001000 */
#define CAN_FACFG_FAEN12                    CAN_FACFG_FAEN12_Msk                    /*!< Filter 12 active enable */
#define CAN_FACFG_FAEN13_Pos                (13U)
#define CAN_FACFG_FAEN13_Msk                (0x1U << CAN_FACFG_FAEN13_Pos)          /*!< 0x00002000 */
#define CAN_FACFG_FAEN13                    CAN_FACFG_FAEN13_Msk                    /*!< Filter 13 active enable */
#define CAN_FACFG_FAEN14_Pos                (14U)
#define CAN_FACFG_FAEN14_Msk                (0x1U << CAN_FACFG_FAEN14_Pos)          /*!< 0x00004000 */
#define CAN_FACFG_FAEN14                    CAN_FACFG_FAEN14_Msk                    /*!< Filter 14 active enable */
#define CAN_FACFG_FAEN15_Pos                (15U)
#define CAN_FACFG_FAEN15_Msk                (0x1U << CAN_FACFG_FAEN15_Pos)          /*!< 0x00008000 */
#define CAN_FACFG_FAEN15                    CAN_FACFG_FAEN15_Msk                    /*!< Filter 15 active enable */
#define CAN_FACFG_FAEN16_Pos                (16U)
#define CAN_FACFG_FAEN16_Msk                (0x1U << CAN_FACFG_FAEN16_Pos)          /*!< 0x00010000 */
#define CAN_FACFG_FAEN16                    CAN_FACFG_FAEN16_Msk                    /*!< Filter 16 active enable */
#define CAN_FACFG_FAEN17_Pos                (17U)
#define CAN_FACFG_FAEN17_Msk                (0x1U << CAN_FACFG_FAEN17_Pos)          /*!< 0x00020000 */
#define CAN_FACFG_FAEN17                    CAN_FACFG_FAEN17_Msk                    /*!< Filter 17 active enable */
#define CAN_FACFG_FAEN18_Pos                (18U)
#define CAN_FACFG_FAEN18_Msk                (0x1U << CAN_FACFG_FAEN18_Pos)          /*!< 0x00040000 */
#define CAN_FACFG_FAEN18                    CAN_FACFG_FAEN18_Msk                    /*!< Filter 18 active enable */
#define CAN_FACFG_FAEN19_Pos                (19U)
#define CAN_FACFG_FAEN19_Msk                (0x1U << CAN_FACFG_FAEN19_Pos)          /*!< 0x00080000 */
#define CAN_FACFG_FAEN19                    CAN_FACFG_FAEN19_Msk                    /*!< Filter 19 active enable */
#define CAN_FACFG_FAEN20_Pos                (20U)
#define CAN_FACFG_FAEN20_Msk                (0x1U << CAN_FACFG_FAEN20_Pos)          /*!< 0x00100000 */
#define CAN_FACFG_FAEN20                    CAN_FACFG_FAEN20_Msk                    /*!< Filter 20 active enable */
#define CAN_FACFG_FAEN21_Pos                (21U)
#define CAN_FACFG_FAEN21_Msk                (0x1U << CAN_FACFG_FAEN21_Pos)          /*!< 0x00200000 */
#define CAN_FACFG_FAEN21                    CAN_FACFG_FAEN21_Msk                    /*!< Filter 21 active enable */
#define CAN_FACFG_FAEN22_Pos                (22U)
#define CAN_FACFG_FAEN22_Msk                (0x1U << CAN_FACFG_FAEN22_Pos)          /*!< 0x00400000 */
#define CAN_FACFG_FAEN22                    CAN_FACFG_FAEN22_Msk                    /*!< Filter 22 active enable */
#define CAN_FACFG_FAEN23_Pos                (23U)
#define CAN_FACFG_FAEN23_Msk                (0x1U << CAN_FACFG_FAEN23_Pos)          /*!< 0x00800000 */
#define CAN_FACFG_FAEN23                    CAN_FACFG_FAEN23_Msk                    /*!< Filter 23 active enable */
#define CAN_FACFG_FAEN24_Pos                (24U)
#define CAN_FACFG_FAEN24_Msk                (0x1U << CAN_FACFG_FAEN24_Pos)          /*!< 0x01000000 */
#define CAN_FACFG_FAEN24                    CAN_FACFG_FAEN24_Msk                    /*!< Filter 24 active enable */
#define CAN_FACFG_FAEN25_Pos                (25U)
#define CAN_FACFG_FAEN25_Msk                (0x1U << CAN_FACFG_FAEN25_Pos)          /*!< 0x02000000 */
#define CAN_FACFG_FAEN25                    CAN_FACFG_FAEN25_Msk                    /*!< Filter 25 active enable */
#define CAN_FACFG_FAEN26_Pos                (26U)
#define CAN_FACFG_FAEN26_Msk                (0x1U << CAN_FACFG_FAEN26_Pos)          /*!< 0x04000000 */
#define CAN_FACFG_FAEN26                    CAN_FACFG_FAEN26_Msk                    /*!< Filter 26 active enable */
#define CAN_FACFG_FAEN27_Pos                (27U)
#define CAN_FACFG_FAEN27_Msk                (0x1U << CAN_FACFG_FAEN27_Pos)          /*!< 0x08000000 */
#define CAN_FACFG_FAEN27                    CAN_FACFG_FAEN27_Msk                    /*!< Filter 27 active enable */

